---
kind: property
id: P:Autodesk.Revit.DB.FabricationServiceButton.ConditionCount
source: html/2a8835cd-d6d8-6c6a-c054-4facac9b0f34.htm
---
# Autodesk.Revit.DB.FabricationServiceButton.ConditionCount Property

The number of conditions.

## Syntax (C#)
```csharp
public int ConditionCount { get; }
```